// TODO: 변수(變數, variable)는 수학에서 쓰이는 수식에 따라서 변하는 값을 뜻한다.
a = 221;
b = a - 5;
console.log(b); // 216

// 모든 instructions(명령)은 각기 다른 라인에 존재 합니다.
// 이 라인들은 "Line"이라고 부르는 대신에 "Expression(식, 표현)"이라고 부릅니다.
// 모든 Expression(식, 표현)은 한 줄에 있어야 합니다.
// Expression(식, 표현)을 종료 할때는 ;(세미콜론)을 Expression(식, 표현)에 마지막에 작성합니다.

// 기본적으로 변수를 위 와같이 선언하는 방식은 매우 나쁜 방식입니다.

// 변수를 만들고 싶을 때는 기본적으로 이렇게 작동합니다.
// 1. Create (생성)
// 2. Intialize (초기화)
// 3. Use (사용)

// 때로는 Create (생성)과 Intialize (초기화)를 한번에 진행합니다.
// 사용은 나중에 할 수 있습니다.
// 위의 a 의 변수에서는 a를 생성하고 숫자 221로 초기화를 진행 한 것입니다.
