
public class index {

	public static void main(String[] args) {
		
//		 자바에서는 Scanner 클래스만 잘 활용해도 다양한 입출력 형태를 자유자재로 구사할 수 있습니다.
//
//		 주석은 일단 최대한 많이 작성하는 습관을 들이세요.
//		 주석은 컴파일 단계에서 제거 되기에 프로그램의 크기와는 상관이 없습니다.
//
//		 Scanner로 문자열을 입력 받고 싶을때에는 next() 함수와 nextLine() 을 적절히 사용할 수 있습니다. 
		
//		1. 개발황경 설치
//
//		이클립스는 JDK로서 대표적인 개발 환경입니다. 이크립스를 이용하면 JSP, Java Swing부터 시작해 
//
//		다양한 자바 개발을 시작할 수 있습니다.
//
//		​
//
//		2. 변수
//
//		변수는 그 내부에 있는 값을 프로그램이 실행되는 도중에 언제든지 교체할 수 있습니다.
//
//		하지만 상수는 한 번 설정되면 프로그램이 종료될 때까지 변경되지 않는 데이터라고 할 수 있습니다.
//
//		​
//
//		3. 자료형 
//
//		일반적인 프로그래밍 언어에는 정수 자료형 int, 실수 자료형 floar과 double, 문자 자료형 char 문자열 자료형 String이 사용됩니다.
//
//		자바에선 특히 String을 많이 활용하게 됩니다.
//
//		​
//
//		4. 연산자
//
//		연산자는 >, <, ==, ++ 등의 다양한 형태로 다수의 데이터를 비교하거나, 데이터를 변경할 수 있게 합니다.
//
//		특히 &&와 ||는 AND, OR 연산으로서 조건문과 반복문에서도 많이 사용됩니다.
//
//		​
//
//		5. 조건문 & 반복문
//
//		조건문과 반복문은 프로그래밍의 논리적 흐름에 있어 가장 중요한 부분입니다.
//
//		여러 개의 데이터를 서로 비교하거나 1 부터 100까지 반복하는 등 다양한
//
//		논리적 흐름에 따라 프로그램을 전개 할 수 있도록 해줍니다.
//
//		​
//
//		6. 기본 입출력
//
//		자바에서는 입력을 받을 때 기본적으로 Scanner 클래스를 가장 많이 활용합니다.
//
//		Scanner 클래스는 정수를 입력받는 nextInt(), 실수를 입력 받는 next() 문자열을 입력받는 
//
//		nextLine() 등 다양한 함수를 지원합니다.

	}

}
